print("привет")
ans1=input("как дела?")
if ans1=="хорошо":
    print("у меня тоже!")
else:
    ans2=input("сочуствую,чем могу помочь?")
    if ans2== "ничем":
        pass
    else:
        ans3=input("тогда ты мне можешь просто расказать о своей проблеме")
        print("👎")
ans4=input("хочешь включить минутку фактов?")
if ans4==("да"):
    print("некоторые виды черепах могу дышать попой...")
vop=input("ещё факты?")
if vop=="да":
    print("на логотипе монополии нету монокля")
print("минутка интересных фактов окончена(автору лень искать ещё)")
vop2=input("закончить диалог?")
if vop2==("да"):
    print("диалог окнчен")
else:
    print("The end")






